app/controllers/test_controller.rb

  def index
    Rails.logger.warn "Index in"
    @map = Array.new
    if(params['chinese'])
      UserInput.new(:input=>params['chinese']).save
---
INSERT INTO "user_inputs" ("input", "created_at", "updated_at") VALUES (?, ?, ?)  [["input", "我愛你"], ["created_at", "2016-01-12 07:43:56.081959"], ["updated_at", "2016-01-12 07:43:56.081959"]]